run/tutorial1_viewfactor/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

functions
(
    heatFlux
    {
        // Type of functionObject
        type heatFlux;
        outputControl timeStep;
        outputInterval 1;

        // Where to load it from (if not already in solver)
        functionObjectLibs ("libairbusMaterialModels.so");

        K              kappaEff;
    }

    heatFlux
    {
        // Type of functionObject
        type heatFlux;
        outputControl timeStep;
        outputInterval 1;
        region solid;

        // Where to load it from (if not already in solver)
        functionObjectLibs ("libairbusMaterialModels.so");

        K              k;
    }
);

// ************************************************************************* //
