run/tutorial1_viewfactor/constant/F
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       scalarListList;
    location    "constant";
    object      F;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


20
(

15
(
0.0196884
0.0249156
0.0616966
0.109413
0.180838
0.0414516
0.0435958
0.042761
0.0344365
0.013391
0.0990195
0.0976077
0.0798209
0.0673196
0.0514603
)


15
(
0.0303518
0.0376324
0.0808839
0.118783
0.110471
0.0435958
0.0469328
0.0501104
0.0421056
0.0170384
0.0976077
0.0990195
0.0874006
0.0756804
0.0591255
)


15
(
0.0448306
0.0509797
0.0682941
0.0655843
0.0305416
0.042761
0.0501104
0.0776207
0.0827748
0.0438739
0.0798209
0.0874006
0.0990195
0.0957785
0.0836711
)


15
(
0.044244
0.0482183
0.053969
0.0471216
0.019586
0.0344365
0.0421056
0.0827748
0.105147
0.0761155
0.0673196
0.0756804
0.0957785
0.0985376
0.093157
)


15
(
0.040094
0.0417121
0.0394063
0.0314425
0.0120431
0.013391
0.0170384
0.0438739
0.0761155
0.118034
0.0514603
0.0591255
0.0836711
0.093157
0.0985376
)


15
(
0.0196884
0.0303518
0.0448306
0.044244
0.040094
0.0990195
0.0976077
0.0798209
0.0673196
0.0514603
0.214095
0.142177
0.0437827
0.0281102
0.0175809
)


15
(
0.0249156
0.0376324
0.0509797
0.0482183
0.0417121
0.0976077
0.0990195
0.0874006
0.0756804
0.0591255
0.142177
0.136176
0.0614703
0.0419207
0.0273253
)


15
(
0.0616966
0.0808839
0.0682941
0.053969
0.0394063
0.0798209
0.0874006
0.0990195
0.0957785
0.0836711
0.0437827
0.0614703
0.0637598
0.0539697
0.0418521
)


15
(
0.109413
0.118783
0.0655843
0.0471216
0.0314425
0.0673196
0.0756804
0.0957785
0.0985376
0.093157
0.0281102
0.0419207
0.0539697
0.0494827
0.0418521
)


15
(
0.180838
0.110471
0.0305416
0.019586
0.0120431
0.0514603
0.0591255
0.0836711
0.093157
0.0985376
0.0175809
0.0273253
0.0418521
0.0418521
0.0388004
)


15
(
0.0414516
0.0435958
0.042761
0.0344365
0.013391
0.0990195
0.0976077
0.0798209
0.0673196
0.0514603
0.0196884
0.0249156
0.0616966
0.109413
0.180838
)


15
(
0.0435958
0.0469328
0.0501104
0.0421056
0.0170384
0.0976077
0.0990195
0.0874006
0.0756804
0.0591255
0.0303518
0.0376324
0.0808839
0.118783
0.110471
)


15
(
0.042761
0.0501104
0.0776207
0.0827748
0.0438739
0.0798209
0.0874006
0.0990195
0.0957785
0.0836711
0.0448306
0.0509797
0.0682941
0.0655843
0.0305416
)


15
(
0.0344365
0.0421056
0.0827748
0.105147
0.0761155
0.0673196
0.0756804
0.0957785
0.0985376
0.093157
0.044244
0.0482183
0.053969
0.0471216
0.019586
)


15
(
0.013391
0.0170384
0.0438739
0.0761155
0.118034
0.0514603
0.0591255
0.0836711
0.093157
0.0985376
0.040094
0.0417121
0.0394063
0.0314425
0.0120431
)


15
(
0.0990195
0.0976077
0.0798209
0.0673196
0.0514603
0.214095
0.142177
0.0437827
0.0281102
0.0175809
0.0196884
0.0303518
0.0448306
0.044244
0.040094
)


15
(
0.0976077
0.0990195
0.0874006
0.0756804
0.0591255
0.142177
0.136176
0.0614703
0.0419207
0.0273253
0.0249156
0.0376324
0.0509797
0.0482183
0.0417121
)


15
(
0.0798209
0.0874006
0.0990195
0.0957785
0.0836711
0.0437827
0.0614703
0.0637598
0.0539697
0.0418521
0.0616966
0.0808839
0.0682941
0.053969
0.0394063
)


15
(
0.0673196
0.0756804
0.0957785
0.0985376
0.093157
0.0281102
0.0419207
0.0539697
0.0494827
0.0418521
0.109413
0.118783
0.0655843
0.0471216
0.0314425
)


15
(
0.0514603
0.0591255
0.0836711
0.093157
0.0985376
0.0175809
0.0273253
0.0418521
0.0418521
0.0388004
0.180838
0.110471
0.0305416
0.019586
0.0120431
)

)


// ************************************************************************* //
