run/tutorial1_viewfactor/constant/viewFactorsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      viewFactorsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

writeViewFactorMatrix     true;
writeFacesAgglomeration   true;

movingWall
{
    nFacesInCoarsestLevel     30;
    featureAngle              10;
}

left
{
    nFacesInCoarsestLevel     20;
    featureAngle              10;
}

right
{
    nFacesInCoarsestLevel     20;
    featureAngle              10;
}

bottom
{
    nFacesInCoarsestLevel     10;
    featureAngle              10;
}

frontAndBack
{
    nFacesInCoarsestLevel     50;
    featureAngle              10;
}

// ************************************************************************* //
